GopalSaraf/Practicals/PSDL/include/proc/pic16lf1783.inc
// Register: WPUC
#define WPUC WPUC
WPUC                                     equ 020Eh
// bitfield definitions
WPUC_WPUC0_POSN                          equ 0000h
WPUC_WPUC0_POSITION                      equ 0000h
WPUC_WPUC0_SIZE                          equ 0001h
WPUC_WPUC0_LENGTH                        equ 0001h
WPUC_WPUC0_MASK                          equ 0001h
WPUC_WPUC1_POSN                          equ 0001h
WPUC_WPUC1_POSITION                      equ 0001h
WPUC_WPUC1_SIZE                          equ 0001h
WPUC_WPUC1_LENGTH                        equ 0001h
WPUC_WPUC1_MASK                          equ 0002h
WPUC_WPUC2_POSN                          equ 0002h
WPUC_WPUC2_POSITION                      equ 0002h
WPUC_WPUC2_SIZE                          equ 0001h
WPUC_WPUC2_LENGTH                        equ 0001h
WPUC_WPUC2_MASK                          equ 0004h
WPUC_WPUC3_POSN                          equ 0003h
WPUC_WPUC3_POSITION                      equ 0003h
WPUC_WPUC3_SIZE                          equ 0001h
WPUC_WPUC3_LENGTH                        equ 0001h
WPUC_WPUC3_MASK                          equ 0008h
WPUC_WPUC4_POSN                          equ 0004h
WPUC_WPUC4_POSITION                      equ 0004h
WPUC_WPUC4_SIZE                          equ 0001h
WPUC_WPUC4_LENGTH                        equ 0001h
WPUC_WPUC4_MASK                          equ 0010h
WPUC_WPUC5_POSN                          equ 0005h
WPUC_WPUC5_POSITION                      equ 0005h
WPUC_WPUC5_SIZE                          equ 0001h
WPUC_WPUC5_LENGTH                        equ 0001h
WPUC_WPUC5_MASK                          equ 0020h
WPUC_WPUC6_POSN                          equ 0006h
WPUC_WPUC6_POSITION                      equ 0006h
WPUC_WPUC6_SIZE                          equ 0001h
WPUC_WPUC6_LENGTH                        equ 0001h
WPUC_WPUC6_MASK                          equ 0040h
WPUC_WPUC7_POSN                          equ 0007h
WPUC_WPUC7_POSITION                      equ 0007h
WPUC_WPUC7_SIZE                          equ 0001h
WPUC_WPUC7_LENGTH                        equ 0001h
WPUC_WPUC7_MASK                          equ 0080h
WPUC_WPUC_POSN                           equ 0000h
WPUC_WPUC_POSITION                       equ 0000h
WPUC_WPUC_SIZE                           equ 0008h
WPUC_WPUC_LENGTH                         equ 0008h
WPUC_WPUC_MASK                           equ 00FFh

// Register: WPUE
#define WPUE WPUE
WPUE                                     equ 0210h
// bitfield definitions
WPUE_WPUE3_POSN                          equ 0003h
WPUE_WPUE3_POSITION                      equ 0003h
WPUE_WPUE3_SIZE                          equ 0001h
WPUE_WPUE3_LENGTH                        equ 0001h
WPUE_WPUE3_MASK                          equ 0008h

// Register: SSPBUF
#define SSPBUF SSPBUF
SSPBUF                                   equ 0211h
// bitfield definitions
SSPBUF_SSPBUF_POSN                       equ 0000h
SSPBUF_SSPBUF_POSITION                   equ 0000h
SSPBUF_SSPBUF_SIZE                       equ 0008h
SSPBUF_SSPBUF_LENGTH                     equ 0008h
SSPBUF_SSPBUF_MASK                       equ 00FFh

// Register: SSPADD
#define SSPADD SSPADD
SSPADD                                   equ 0212h
// bitfield definitions
SSPADD_SSPADD_POSN                       equ 0000h
SSPADD_SSPADD_POSITION                   equ 0000h
SSPADD_SSPADD_SIZE                       equ 0008h
SSPADD_SSPADD_LENGTH                     equ 0008h
SSPADD_SSPADD_MASK                       equ 00FFh

// Register: SSPMSK
#define SSPMSK SSPMSK
SSPMSK                                   equ 0213h
// bitfield definitions
SSPMSK_SSPMSK_POSN                       equ 0000h
SSPMSK_SSPMSK_POSITION                   equ 0000h
SSPMSK_SSPMSK_SIZE                       equ 0008h
SSPMSK_SSPMSK_LENGTH                     equ 0008h
SSPMSK_SSPMSK_MASK                       equ 00FFh

// Register: SSPSTAT
#define SSPSTAT SSPSTAT
SSPSTAT                                  equ 0214h
// bitfield definitions
SSPSTAT_BF_POSN                          equ 0000h
SSPSTAT_BF_POSITION                      equ 0000h
SSPSTAT_BF_SIZE                          equ 0001h
SSPSTAT_BF_LENGTH                        equ 0001h
SSPSTAT_BF_MASK                          equ 0001h
SSPSTAT_UA_POSN                          equ 0001h
SSPSTAT_UA_POSITION                      equ 0001h
SSPSTAT_UA_SIZE                          equ 0001h
SSPSTAT_UA_LENGTH                        equ 0001h
SSPSTAT_UA_MASK                          equ 0002h
SSPSTAT_R_nW_POSN                        equ 0002h
SSPSTAT_R_nW_POSITION                    equ 0002h
SSPSTAT_R_nW_SIZE                        equ 0001h
SSPSTAT_R_nW_LENGTH                      equ 0001h
SSPSTAT_R_nW_MASK                        equ 0004h
SSPSTAT_S_POSN                           equ 0003h
SSPSTAT_S_POSITION                       equ 0003h
SSPSTAT_S_SIZE                           equ 0001h
SSPSTAT_S_LENGTH                         equ 0001h
SSPSTAT_S_MASK                           equ 0008h
SSPSTAT_P_POSN                           equ 0004h
SSPSTAT_P_POSITION                       equ 0004h
SSPSTAT_P_SIZE                           equ 0001h
SSPSTAT_P_LENGTH                         equ 0001h
SSPSTAT_P_MASK                           equ 0010h
SSPSTAT_D_nA_POSN                        equ 0005h
SSPSTAT_D_nA_POSITION                    equ 0005h
SSPSTAT_D_nA_SIZE                        equ 0001h
SSPSTAT_D_nA_LENGTH                      equ 0001h
SSPSTAT_D_nA_MASK                        equ 0020h
SSPSTAT_CKE_POSN                         equ 0006h
SSPSTAT_CKE_POSITION                     equ 0006h
SSPSTAT_CKE_SIZE                         equ 0001h
SSPSTAT_CKE_LENGTH                       equ 0001h
SSPSTAT_CKE_MASK                         equ 0040h
SSPSTAT_SMP_POSN                         equ 0007h
SSPSTAT_SMP_POSITION                     equ 0007h
SSPSTAT_SMP_SIZE                         equ 0001h
SSPSTAT_SMP_LENGTH                       equ 0001h
SSPSTAT_SMP_MASK                         equ 0080h

// Register: SSPCON1
#define SSPCON1 SSPCON1
SSPCON1                                  equ 0215h
// bitfield definitions
SSPCON1_SSPM0_POSN                       equ 0000h
SSPCON1_SSPM0_POSITION                   equ 0000h
SSPCON1_SSPM0_SIZE                       equ 0001h
SSPCON1_SSPM0_LENGTH                     equ 0001h
SSPCON1_SSPM0_MASK                       equ 0001h
SSPCON1_SSPM1_POSN                       equ 0001h
SSPCON1_SSPM1_POSITION                   equ 0001h
SSPCON1_SSPM1_SIZE                       equ 0001h
SSPCON1_SSPM1_LENGTH                     equ 0001h
SSPCON1_SSPM1_MASK                       equ 0002h
SSPCON1_SSPM2_POSN                       equ 0002h
SSPCON1_SSPM2_POSITION                   equ 0002h
SSPCON1_SSPM2_SIZE                       equ 0001h
SSPCON1_SSPM2_LENGTH                     equ 0001h
SSPCON1_SSPM2_MASK                       equ 0004h
SSPCON1_SSPM3_POSN                       equ 0003h
SSPCON1_SSPM3_POSITION                   equ 0003h
SSPCON1_SSPM3_SIZE                       equ 0001h
SSPCON1_SSPM3_LENGTH                     equ 0001h
SSPCON1_SSPM3_MASK                       equ 0008h
SSPCON1_CKP_POSN                         equ 0004h
SSPCON1_CKP_POSITION                     equ 0004h
SSPCON1_CKP_SIZE                         equ 0001h
SSPCON1_CKP_LENGTH                       equ 0001h
SSPCON1_CKP_MASK                         equ 0010h
SSPCON1_SSPEN_POSN                       equ 0005h
SSPCON1_SSPEN_POSITION                   equ 0005h
SSPCON1_SSPEN_SIZE                       equ 0001h
SSPCON1_SSPEN_LENGTH                     equ 0001h
SSPCON1_SSPEN_MASK                       equ 0020h
SSPCON1_SSPOV_POSN                       equ 0006h
SSPCON1_SSPOV_POSITION                   equ 0006h
SSPCON1_SSPOV_SIZE                       equ 0001h
SSPCON1_SSPOV_LENGTH                     equ 0001h
SSPCON1_SSPOV_MASK                       equ 0040h
SSPCON1_WCOL_POSN                        equ 0007h
SSPCON1_WCOL_POSITION                    equ 0007h
SSPCON1_WCOL_SIZE                        equ 0001h
SSPCON1_WCOL_LENGTH                      equ 0001h
SSPCON1_WCOL_MASK                        equ 0080h
SSPCON1_SSPM_POSN                        equ 0000h
SSPCON1_SSPM_POSITION                    equ 0000h
SSPCON1_SSPM_SIZE                        equ 0004h
SSPCON1_SSPM_LENGTH                      equ 0004h
SSPCON1_SSPM_MASK                        equ 000Fh

// Register: SSPCON2
#define SSPCON2 SSPCON2
SSPCON2                                  equ 0216h
// bitfield definitions
SSPCON2_SEN_POSN                         equ 0000h
SSPCON2_SEN_POSITION                     equ 0000h
SSPCON2_SEN_SIZE                         equ 0001h
SSPCON2_SEN_LENGTH                       equ 0001h
SSPCON2_SEN_MASK                         equ 0001h
SSPCON2_RSEN_POSN                        equ 0001h
SSPCON2_RSEN_POSITION                    equ 0001h
SSPCON2_RSEN_SIZE                        equ 0001h
SSPCON2_RSEN_LENGTH                      equ 0001h
SSPCON2_RSEN_MASK                        equ 0002h
SSPCON2_PEN_POSN                         equ 0002h
SSPCON2_PEN_POSITION                     equ 0002h
SSPCON2_PEN_SIZE                         equ 0001h
SSPCON2_PEN_LENGTH                       equ 0001h
SSPCON2_PEN_MASK                         equ 0004h
SSPCON2_RCEN_POSN                        equ 0003h
SSPCON2_RCEN_POSITION                    equ 0003h
SSPCON2_RCEN_SIZE                        equ 0001h
SSPCON2_RCEN_LENGTH                      equ 0001h
SSPCON2_RCEN_MASK                        equ 0008h
SSPCON2_ACKEN_POSN                       equ 0004h
SSPCON2_ACKEN_POSITION                   equ 0004h
SSPCON2_ACKEN_SIZE                       equ 0001h
SSPCON2_ACKEN_LENGTH                     equ 0001h
SSPCON2_ACKEN_MASK                       equ 0010h
SSPCON2_ACKDT_POSN                       equ 0005h
SSPCON2_ACKDT_POSITION                   equ 0005h
SSPCON2_ACKDT_SIZE                       equ 0001h
SSPCON2_ACKDT_LENGTH                     equ 0001h
SSPCON2_ACKDT_MASK                       equ 0020h
SSPCON2_ACKSTAT_POSN                     equ 0006h
SSPCON2_ACKSTAT_POSITION                 equ 0006h
SSPCON2_ACKSTAT_SIZE                     equ 0001h
SSPCON2_ACKSTAT_LENGTH                   equ 0001h
SSPCON2_ACKSTAT_MASK                     equ 0040h
SSPCON2_GCEN_POSN                        equ 0007h
SSPCON2_GCEN_POSITION                    equ 0007h
SSPCON2_GCEN_SIZE                        equ 0001h
SSPCON2_GCEN_LENGTH                      equ 0001h
SSPCON2_GCEN_MASK                        equ 0080h

// Register: SSPCON3
#define SSPCON3 SSPCON3
SSPCON3                                  equ 0217h
// bitfield definitions
SSPCON3_DHEN_POSN                        equ 0000h
SSPCON3_DHEN_POSITION                    equ 0000h
SSPCON3_DHEN_SIZE                        equ 0001h
SSPCON3_DHEN_LENGTH                      equ 0001h
SSPCON3_DHEN_MASK                        equ 0001h
SSPCON3_AHEN_POSN                        equ 0001h
SSPCON3_AHEN_POSITION                    equ 0001h
SSPCON3_AHEN_SIZE                        equ 0001h
SSPCON3_AHEN_LENGTH                      equ 0001h
SSPCON3_AHEN_MASK                        equ 0002h
SSPCON3_SBCDE_POSN                       equ 0002h
SSPCON3_SBCDE_POSITION                   equ 0002h
SSPCON3_SBCDE_SIZE                       equ 0001h
SSPCON3_SBCDE_LENGTH                     equ 0001h
SSPCON3_SBCDE_MASK                       equ 0004h
SSPCON3_SDAHT_POSN                       equ 0003h
SSPCON3_SDAHT_POSITION                   equ 0003h
SSPCON3_SDAHT_SIZE                       equ 0001h
SSPCON3_SDAHT_LENGTH                     equ 0001h
SSPCON3_SDAHT_MASK                       equ 0008h
SSPCON3_BOEN_POSN                        equ 0004h
SSPCON3_BOEN_POSITION                    equ 0004h
SSPCON3_BOEN_SIZE                        equ 0001h
SSPCON3_BOEN_LENGTH                      equ 0001h
SSPCON3_BOEN_MASK                        equ 0010h
SSPCON3_SCIE_POSN                        equ 0005h
SSPCON3_SCIE_POSITION                    equ 0005h
SSPCON3_SCIE_SIZE                        equ 0001h
SSPCON3_SCIE_LENGTH                      equ 0001h
SSPCON3_SCIE_MASK                        equ 0020h
SSPCON3_PCIE_POSN                        equ 0006h
SSPCON3_PCIE_POSITION                    equ 0006h
SSPCON3_PCIE_SIZE                        equ 0001h
SSPCON3_PCIE_LENGTH                      equ 0001h
SSPCON3_PCIE_MASK                        equ 0040h
SSPCON3_ACKTIM_POSN                      equ 0007h
SSPCON3_ACKTIM_POSITION                  equ 0007h
SSPCON3_ACKTIM_SIZE                      equ 0001h
SSPCON3_ACKTIM_LENGTH                    equ 0001h
SSPCON3_ACKTIM_MASK                      equ 0080h

// Register: ODCONA
#define ODCONA ODCONA
ODCONA                                   equ 028Ch
// bitfield definitions
ODCONA_ODCONA0_POSN                      equ 0000h
ODCONA_ODCONA0_POSITION                  equ 0000h
ODCONA_ODCONA0_SIZE                      equ 0001h
ODCONA_ODCONA0_LENGTH                    equ 0001h
ODCONA_ODCONA0_MASK                      equ 0001h
ODCONA_ODCONA1_POSN                      equ 0001h
ODCONA_ODCONA1_POSITION                  equ 0001h
ODCONA_ODCONA1_SIZE                      equ 0001h
ODCONA_ODCONA1_LENGTH                    equ 0001h
ODCONA_ODCONA1_MASK                      equ 0002h
ODCONA_ODCONA2_POSN                      equ 0002h
ODCONA_ODCONA2_POSITION                  equ 0002h
ODCONA_ODCONA2_SIZE                      equ 0001h
ODCONA_ODCONA2_LENGTH                    equ 0001h
ODCONA_ODCONA2_MASK                      equ 0004h
ODCONA_ODCONA3_POSN                      equ 0003h
ODCONA_ODCONA3_POSITION                  equ 0003h
ODCONA_ODCONA3_SIZE                      equ 0001h
ODCONA_ODCONA3_LENGTH                    equ 0001h
ODCONA_ODCONA3_MASK                      equ 0008h
ODCONA_ODCONA4_POSN                      equ 0004h
ODCONA_ODCONA4_POSITION                  equ 0004h
ODCONA_ODCONA4_SIZE                      equ 0001h
ODCONA_ODCONA4_LENGTH                    equ 0001h
ODCONA_ODCONA4_MASK                      equ 0010h
ODCONA_ODCONA5_POSN                      equ 0005h
ODCONA_ODCONA5_POSITION                  equ 0005h
ODCONA_ODCONA5_SIZE                      equ 0001h
ODCONA_ODCONA5_LENGTH                    equ 0001h
ODCONA_ODCONA5_MASK                      equ 0020h
ODCONA_ODCONA6_POSN                      equ 0006h
ODCONA_ODCONA6_POSITION                  equ 0006h
ODCONA_ODCONA6_SIZE                      equ 0001h
ODCONA_ODCONA6_LENGTH                    equ 0001h
ODCONA_ODCONA6_MASK                      equ 0040h
ODCONA_ODCONA7_POSN                      equ 0007h
ODCONA_ODCONA7_POSITION                  equ 0007h
ODCONA_ODCONA7_SIZE                      equ 0001h
ODCONA_ODCONA7_LENGTH                    equ 0001h
ODCONA_ODCONA7_MASK                      equ 0080h
ODCONA_ODCONA_POSN                       equ 0000h
ODCONA_ODCONA_POSITION                   equ 0000h
ODCONA_ODCONA_SIZE                       equ 0008h
ODCONA_ODCONA_LENGTH                     equ 0008h
ODCONA_ODCONA_MASK                       equ 00FFh

// Register: ODCONB
#define ODCONB ODCONB
ODCONB                                   equ 028Dh
// bitfield definitions
ODCONB_ODCONB0_POSN                      equ 0000h
ODCONB_ODCONB0_POSITION                  equ 0000h
ODCONB_ODCONB0_SIZE                      equ 0001h
ODCONB_ODCONB0_LENGTH                    equ 0001h
ODCONB_ODCONB0_MASK                      equ 0001h
ODCONB_ODCONB1_POSN                      equ 0001h
ODCONB_ODCONB1_POSITION                  equ 0001h
ODCONB_ODCONB1_SIZE                      equ 0001h
ODCONB_ODCONB1_LENGTH                    equ 0001h
ODCONB_ODCONB1_MASK                      equ 0002h
ODCONB_ODCONB2_POSN                      equ 0002h
ODCONB_ODCONB2_POSITION                  equ 0002h
ODCONB_ODCONB2_SIZE                      equ 0001h
ODCONB_ODCONB2_LENGTH                    equ 0001h
ODCONB_ODCONB2_MASK                      equ 0004h
ODCONB_ODCONB3_POSN                      equ 0003h
ODCONB_ODCONB3_POSITION                  equ 0003h
ODCONB_ODCONB3_SIZE                      equ 0001h
ODCONB_ODCONB3_LENGTH                    equ 0001h
ODCONB_ODCONB3_MASK                      equ 0008h
ODCONB_ODCONB4_POSN                      equ 0004h
ODCONB_ODCONB4_POSITION                  equ 0004h
ODCONB_ODCONB4_SIZE                      equ 0001h
ODCONB_ODCONB4_LENGTH                    equ 0001h
ODCONB_ODCONB4_MASK                      equ 0010h
ODCONB_ODCONB5_POSN                      equ 0005h
ODCONB_ODCONB5_POSITION                  equ 0005h
ODCONB_ODCONB5_SIZE                      equ 0001h
ODCONB_ODCONB5_LENGTH                    equ 0001h
ODCONB_ODCONB5_MASK                      equ 0020h
ODCONB_ODCONB6_POSN                      equ 0006h
ODCONB_ODCONB6_POSITION                  equ 0006h
ODCONB_ODCONB6_SIZE                      equ 0001h
ODCONB_ODCONB6_LENGTH                    equ 0001h
ODCONB_ODCONB6_MASK                      equ 0040h
ODCONB_ODCONB7_POSN                      equ 0007h
ODCONB_ODCONB7_POSITION                  equ 0007h
ODCONB_ODCONB7_SIZE                      equ 0001h
ODCONB_ODCONB7_LENGTH                    equ 0001h
ODCONB_ODCONB7_MASK                      equ 0080h
ODCONB_ODCONB_POSN                       equ 0000h
ODCONB_ODCONB_POSITION                   equ 0000h
ODCONB_ODCONB_SIZE                       equ 0008h
ODCONB_ODCONB_LENGTH                     equ 0008h
ODCONB_ODCONB_MASK                       equ 00FFh

// Register: ODCONC
#define ODCONC ODCONC
ODCONC                                   equ 028Eh
// bitfield definitions
ODCONC_ODCONC0_POSN                      equ 0000h
ODCONC_ODCONC0_POSITION                  equ 0000h
ODCONC_ODCONC0_SIZE                      equ 0001h
ODCONC_ODCONC0_LENGTH                    equ 0001h
ODCONC_ODCONC0_MASK                      equ 0001h
ODCONC_ODCONC1_POSN                      equ 0001h
ODCONC_ODCONC1_POSITION                  equ 0001h
ODCONC_ODCONC1_SIZE                      equ 0001h
ODCONC_ODCONC1_LENGTH                    equ 0001h
ODCONC_ODCONC1_MASK                      equ 0002h
ODCONC_ODCONC2_POSN                      equ 0002h
ODCONC_ODCONC2_POSITION                  equ 0002h
ODCONC_ODCONC2_SIZE                      equ 0001h
ODCONC_ODCONC2_LENGTH                    equ 0001h
ODCONC_ODCONC2_MASK                      equ 0004h
ODCONC_ODCONC3_POSN                      equ 0003h
ODCONC_ODCONC3_POSITION                  equ 0003h
ODCONC_ODCONC3_SIZE                      equ 0001h
ODCONC_ODCONC3_LENGTH                    equ 0001h
ODCONC_ODCONC3_MASK                      equ 0008h
ODCONC_ODCONC4_POSN                      equ 0004h
ODCONC_ODCONC4_POSITION                  equ 0004h
ODCONC_ODCONC4_SIZE                      equ 0001h
ODCONC_ODCONC4_LENGTH                    equ 0001h
ODCONC_ODCONC4_MASK                      equ 0010h
ODCONC_ODCONC5_POSN                      equ 0005h
ODCONC_ODCONC5_POSITION                  equ 0005h
ODCONC_ODCONC5_SIZE                      equ 0001h
ODCONC_ODCONC5_LENGTH                    equ 0001h
ODCONC_ODCONC5_MASK                      equ 0020h
ODCONC_ODCONC6_POSN                      equ 0006h
ODCONC_ODCONC6_POSITION                  equ 0006h
ODCONC_ODCONC6_SIZE                      equ 0001h
ODCONC_ODCONC6_LENGTH                    equ 0001h
ODCONC_ODCONC6_MASK                      equ 0040h
ODCONC_ODCONC7_POSN                      equ 0007h
ODCONC_ODCONC7_POSITION                  equ 0007h
ODCONC_ODCONC7_SIZE                      equ 0001h
ODCONC_ODCONC7_LENGTH                    equ 0001h
ODCONC_ODCONC7_MASK                      equ 0080h
ODCONC_ODCONC_POSN                       equ 0000h
ODCONC_ODCONC_POSITION                   equ 0000h
ODCONC_ODCONC_SIZE                       equ 0008h
ODCONC_ODCONC_LENGTH                     equ 0008h
ODCONC_ODCONC_MASK                       equ 00FFh

// Register: CCPR1L
#define CCPR1L CCPR1L
CCPR1L                                   equ 0291h
// bitfield definitions
CCPR1L_CCPR1L_POSN                       equ 0000h
CCPR1L_CCPR1L_POSITION                   equ 0000h
CCPR1L_CCPR1L_SIZE                       equ 0008h
CCPR1L_CCPR1L_LENGTH                     equ 0008h
CCPR1L_CCPR1L_MASK                       equ 00FFh

// Register: CCPR1H
#define CCPR1H CCPR1H
CCPR1H                                   equ 0292h
// bitfield definitions
CCPR1H_CCPR1H_POSN                       equ 0000h
CCPR1H_CCPR1H_POSITION                   equ 0000h
CCPR1H_CCPR1H_SIZE                       equ 0008h
CCPR1H_CCPR1H_LENGTH                     equ 0008h
CCPR1H_CCPR1H_MASK                       equ 00FFh

// Register: CCP1CON
#define CCP1CON CCP1CON
CCP1CON                                  equ 0293h
// bitfield definitions
CCP1CON_CCP1M0_POSN                      equ 0000h
CCP1CON_CCP1M0_POSITION                  equ 0000h
CCP1CON_CCP1M0_SIZE                      equ 0001h
CCP1CON_CCP1M0_LENGTH                    equ 0001h
CCP1CON_CCP1M0_MASK                      equ 0001h
CCP1CON_CCP1M1_POSN                      equ 0001h
CCP1CON_CCP1M1_POSITION                  equ 0001h
CCP1CON_CCP1M1_SIZE                      equ 0001h
CCP1CON_CCP1M1_LENGTH                    equ 0001h
CCP1CON_CCP1M1_MASK                      equ 0002h
CCP1CON_CCP1M2_POSN                      equ 0002h
CCP1CON_CCP1M2_POSITION                  equ 0002h
CCP1CON_CCP1M2_SIZE                      equ 0001h
CCP1CON_CCP1M2_LENGTH                    equ 0001h
CCP1CON_CCP1M2_MASK                      equ 0004h
CCP1CON_CCP1M3_POSN                      equ 0003h
CCP1CON_CCP1M3_POSITION                  equ 0003h
CCP1CON_CCP1M3_SIZE                      equ 0001h
CCP1CON_CCP1M3_LENGTH                    equ 0001h
CCP1CON_CCP1M3_MASK                      equ 0008h
CCP1CON_DC1B0_POSN                       equ 0004h
CCP1CON_DC1B0_POSITION                   equ 0004h
CCP1CON_DC1B0_SIZE                       equ 0001h
CCP1CON_DC1B0_LENGTH                     equ 0001h
CCP1CON_DC1B0_MASK                       equ 0010h
CCP1CON_DC1B1_POSN                       equ 0005h
CCP1CON_DC1B1_POSITION                   equ 0005h
CCP1CON_DC1B1_SIZE                       equ 0001h
CCP1CON_DC1B1_LENGTH                     equ 0001h
CCP1CON_DC1B1_MASK                       equ 0020h
CCP1CON_P1M0_POSN                        equ 0006h
CCP1CON_P1M0_POSITION                    equ 0006h
CCP1CON_P1M0_SIZE                        equ 0001h
CCP1CON_P1M0_LENGTH                      equ 0001h
CCP1CON_P1M0_MASK                        equ 0040h
CCP1CON_P1M1_POSN                        equ 0007h
CCP1CON_P1M1_POSITION                    equ 0007h
CCP1CON_P1M1_SIZE                        equ 0001h
CCP1CON_P1M1_LENGTH                      equ 0001h
CCP1CON_P1M1_MASK                        equ 0080h
CCP1CON_CCP1M_POSN                       equ 0000h
CCP1CON_CCP1M_POSITION                   equ 0000h
CCP1CON_CCP1M_SIZE                       equ 0004h
CCP1CON_CCP1M_LENGTH                     equ 0004h
CCP1CON_CCP1M_MASK                       equ 000Fh
CCP1CON_DC1B_POSN                        equ 0004h
CCP1CON_DC1B_POSITION                    equ 0004h
CCP1CON_DC1B_SIZE                        equ 0002h
CCP1CON_DC1B_LENGTH                      equ 0002h
CCP1CON_DC1B_MASK                        equ 0030h
CCP1CON_P1M_POSN                         equ 0006h
CCP1CON_P1M_POSITION                     equ 0006h
CCP1CON_P1M_SIZE                         equ 0002h
CCP1CON_P1M_LENGTH                       equ 0002h
CCP1CON_P1M_MASK                         equ 00C0h

