GopalSaraf/Practicals/PSDL/include/proc/pic16lf1783.inc
// Register: PSMC2MDL
#define PSMC2MDL PSMC2MDL
PSMC2MDL                                 equ 0832h
// bitfield definitions
PSMC2MDL_P2MSRC_POSN                     equ 0000h
PSMC2MDL_P2MSRC_POSITION                 equ 0000h
PSMC2MDL_P2MSRC_SIZE                     equ 0004h
PSMC2MDL_P2MSRC_LENGTH                   equ 0004h
PSMC2MDL_P2MSRC_MASK                     equ 000Fh
PSMC2MDL_P2MDLBIT_POSN                   equ 0005h
PSMC2MDL_P2MDLBIT_POSITION               equ 0005h
PSMC2MDL_P2MDLBIT_SIZE                   equ 0001h
PSMC2MDL_P2MDLBIT_LENGTH                 equ 0001h
PSMC2MDL_P2MDLBIT_MASK                   equ 0020h
PSMC2MDL_P2MDLPOL_POSN                   equ 0006h
PSMC2MDL_P2MDLPOL_POSITION               equ 0006h
PSMC2MDL_P2MDLPOL_SIZE                   equ 0001h
PSMC2MDL_P2MDLPOL_LENGTH                 equ 0001h
PSMC2MDL_P2MDLPOL_MASK                   equ 0040h
PSMC2MDL_P2MDLEN_POSN                    equ 0007h
PSMC2MDL_P2MDLEN_POSITION                equ 0007h
PSMC2MDL_P2MDLEN_SIZE                    equ 0001h
PSMC2MDL_P2MDLEN_LENGTH                  equ 0001h
PSMC2MDL_P2MDLEN_MASK                    equ 0080h
PSMC2MDL_P2MSRC0_POSN                    equ 0000h
PSMC2MDL_P2MSRC0_POSITION                equ 0000h
PSMC2MDL_P2MSRC0_SIZE                    equ 0001h
PSMC2MDL_P2MSRC0_LENGTH                  equ 0001h
PSMC2MDL_P2MSRC0_MASK                    equ 0001h
PSMC2MDL_P2MSRC1_POSN                    equ 0001h
PSMC2MDL_P2MSRC1_POSITION                equ 0001h
PSMC2MDL_P2MSRC1_SIZE                    equ 0001h
PSMC2MDL_P2MSRC1_LENGTH                  equ 0001h
PSMC2MDL_P2MSRC1_MASK                    equ 0002h
PSMC2MDL_P2MSRC2_POSN                    equ 0002h
PSMC2MDL_P2MSRC2_POSITION                equ 0002h
PSMC2MDL_P2MSRC2_SIZE                    equ 0001h
PSMC2MDL_P2MSRC2_LENGTH                  equ 0001h
PSMC2MDL_P2MSRC2_MASK                    equ 0004h
PSMC2MDL_P2MSRC3_POSN                    equ 0003h
PSMC2MDL_P2MSRC3_POSITION                equ 0003h
PSMC2MDL_P2MSRC3_SIZE                    equ 0001h
PSMC2MDL_P2MSRC3_LENGTH                  equ 0001h
PSMC2MDL_P2MSRC3_MASK                    equ 0008h

// Register: PSMC2SYNC
#define PSMC2SYNC PSMC2SYNC
PSMC2SYNC                                equ 0833h
// bitfield definitions
PSMC2SYNC_P2SYNC0_POSN                   equ 0000h
PSMC2SYNC_P2SYNC0_POSITION               equ 0000h
PSMC2SYNC_P2SYNC0_SIZE                   equ 0001h
PSMC2SYNC_P2SYNC0_LENGTH                 equ 0001h
PSMC2SYNC_P2SYNC0_MASK                   equ 0001h
PSMC2SYNC_P2SYNC1_POSN                   equ 0001h
PSMC2SYNC_P2SYNC1_POSITION               equ 0001h
PSMC2SYNC_P2SYNC1_SIZE                   equ 0001h
PSMC2SYNC_P2SYNC1_LENGTH                 equ 0001h
PSMC2SYNC_P2SYNC1_MASK                   equ 0002h

// Register: PSMC2CLK
#define PSMC2CLK PSMC2CLK
PSMC2CLK                                 equ 0834h
// bitfield definitions
PSMC2CLK_P2CSRC0_POSN                    equ 0000h
PSMC2CLK_P2CSRC0_POSITION                equ 0000h
PSMC2CLK_P2CSRC0_SIZE                    equ 0001h
PSMC2CLK_P2CSRC0_LENGTH                  equ 0001h
PSMC2CLK_P2CSRC0_MASK                    equ 0001h
PSMC2CLK_P2CSRC1_POSN                    equ 0001h
PSMC2CLK_P2CSRC1_POSITION                equ 0001h
PSMC2CLK_P2CSRC1_SIZE                    equ 0001h
PSMC2CLK_P2CSRC1_LENGTH                  equ 0001h
PSMC2CLK_P2CSRC1_MASK                    equ 0002h
PSMC2CLK_P2CPRE0_POSN                    equ 0004h
PSMC2CLK_P2CPRE0_POSITION                equ 0004h
PSMC2CLK_P2CPRE0_SIZE                    equ 0001h
PSMC2CLK_P2CPRE0_LENGTH                  equ 0001h
PSMC2CLK_P2CPRE0_MASK                    equ 0010h
PSMC2CLK_P2CPRE1_POSN                    equ 0005h
PSMC2CLK_P2CPRE1_POSITION                equ 0005h
PSMC2CLK_P2CPRE1_SIZE                    equ 0001h
PSMC2CLK_P2CPRE1_LENGTH                  equ 0001h
PSMC2CLK_P2CPRE1_MASK                    equ 0020h
PSMC2CLK_P2CSRC_POSN                     equ 0000h
PSMC2CLK_P2CSRC_POSITION                 equ 0000h
PSMC2CLK_P2CSRC_SIZE                     equ 0002h
PSMC2CLK_P2CSRC_LENGTH                   equ 0002h
PSMC2CLK_P2CSRC_MASK                     equ 0003h
PSMC2CLK_P2CPRE_POSN                     equ 0004h
PSMC2CLK_P2CPRE_POSITION                 equ 0004h
PSMC2CLK_P2CPRE_SIZE                     equ 0002h
PSMC2CLK_P2CPRE_LENGTH                   equ 0002h
PSMC2CLK_P2CPRE_MASK                     equ 0030h

// Register: PSMC2OEN
#define PSMC2OEN PSMC2OEN
PSMC2OEN                                 equ 0835h
// bitfield definitions
PSMC2OEN_P2OEA_POSN                      equ 0000h
PSMC2OEN_P2OEA_POSITION                  equ 0000h
PSMC2OEN_P2OEA_SIZE                      equ 0001h
PSMC2OEN_P2OEA_LENGTH                    equ 0001h
PSMC2OEN_P2OEA_MASK                      equ 0001h
PSMC2OEN_P2OEB_POSN                      equ 0001h
PSMC2OEN_P2OEB_POSITION                  equ 0001h
PSMC2OEN_P2OEB_SIZE                      equ 0001h
PSMC2OEN_P2OEB_LENGTH                    equ 0001h
PSMC2OEN_P2OEB_MASK                      equ 0002h

// Register: PSMC2POL
#define PSMC2POL PSMC2POL
PSMC2POL                                 equ 0836h
// bitfield definitions
PSMC2POL_P2POLA_POSN                     equ 0000h
PSMC2POL_P2POLA_POSITION                 equ 0000h
PSMC2POL_P2POLA_SIZE                     equ 0001h
PSMC2POL_P2POLA_LENGTH                   equ 0001h
PSMC2POL_P2POLA_MASK                     equ 0001h
PSMC2POL_P2POLB_POSN                     equ 0001h
PSMC2POL_P2POLB_POSITION                 equ 0001h
PSMC2POL_P2POLB_SIZE                     equ 0001h
PSMC2POL_P2POLB_LENGTH                   equ 0001h
PSMC2POL_P2POLB_MASK                     equ 0002h
PSMC2POL_P2INPOL_POSN                    equ 0006h
PSMC2POL_P2INPOL_POSITION                equ 0006h
PSMC2POL_P2INPOL_SIZE                    equ 0001h
PSMC2POL_P2INPOL_LENGTH                  equ 0001h
PSMC2POL_P2INPOL_MASK                    equ 0040h

// Register: PSMC2BLNK
#define PSMC2BLNK PSMC2BLNK
PSMC2BLNK                                equ 0837h
// bitfield definitions
PSMC2BLNK_P2REBM_POSN                    equ 0000h
PSMC2BLNK_P2REBM_POSITION                equ 0000h
PSMC2BLNK_P2REBM_SIZE                    equ 0002h
PSMC2BLNK_P2REBM_LENGTH                  equ 0002h
PSMC2BLNK_P2REBM_MASK                    equ 0003h
PSMC2BLNK_P2FEBM_POSN                    equ 0004h
PSMC2BLNK_P2FEBM_POSITION                equ 0004h
PSMC2BLNK_P2FEBM_SIZE                    equ 0002h
PSMC2BLNK_P2FEBM_LENGTH                  equ 0002h
PSMC2BLNK_P2FEBM_MASK                    equ 0030h
PSMC2BLNK_P2REBM0_POSN                   equ 0000h
PSMC2BLNK_P2REBM0_POSITION               equ 0000h
PSMC2BLNK_P2REBM0_SIZE                   equ 0001h
PSMC2BLNK_P2REBM0_LENGTH                 equ 0001h
PSMC2BLNK_P2REBM0_MASK                   equ 0001h
PSMC2BLNK_P2REBM1_POSN                   equ 0001h
PSMC2BLNK_P2REBM1_POSITION               equ 0001h
PSMC2BLNK_P2REBM1_SIZE                   equ 0001h
PSMC2BLNK_P2REBM1_LENGTH                 equ 0001h
PSMC2BLNK_P2REBM1_MASK                   equ 0002h
PSMC2BLNK_P2FEBM0_POSN                   equ 0004h
PSMC2BLNK_P2FEBM0_POSITION               equ 0004h
PSMC2BLNK_P2FEBM0_SIZE                   equ 0001h
PSMC2BLNK_P2FEBM0_LENGTH                 equ 0001h
PSMC2BLNK_P2FEBM0_MASK                   equ 0010h
PSMC2BLNK_P2FEBM1_POSN                   equ 0005h
PSMC2BLNK_P2FEBM1_POSITION               equ 0005h
PSMC2BLNK_P2FEBM1_SIZE                   equ 0001h
PSMC2BLNK_P2FEBM1_LENGTH                 equ 0001h
PSMC2BLNK_P2FEBM1_MASK                   equ 0020h

// Register: PSMC2REBS
#define PSMC2REBS PSMC2REBS
PSMC2REBS                                equ 0838h
// bitfield definitions
PSMC2REBS_P2REBSC1_POSN                  equ 0001h
PSMC2REBS_P2REBSC1_POSITION              equ 0001h
PSMC2REBS_P2REBSC1_SIZE                  equ 0001h
PSMC2REBS_P2REBSC1_LENGTH                equ 0001h
PSMC2REBS_P2REBSC1_MASK                  equ 0002h
PSMC2REBS_P2REBSC2_POSN                  equ 0002h
PSMC2REBS_P2REBSC2_POSITION              equ 0002h
PSMC2REBS_P2REBSC2_SIZE                  equ 0001h
PSMC2REBS_P2REBSC2_LENGTH                equ 0001h
PSMC2REBS_P2REBSC2_MASK                  equ 0004h
PSMC2REBS_P2REBSC3_POSN                  equ 0003h
PSMC2REBS_P2REBSC3_POSITION              equ 0003h
PSMC2REBS_P2REBSC3_SIZE                  equ 0001h
PSMC2REBS_P2REBSC3_LENGTH                equ 0001h
PSMC2REBS_P2REBSC3_MASK                  equ 0008h
PSMC2REBS_P2REBSIN_POSN                  equ 0007h
PSMC2REBS_P2REBSIN_POSITION              equ 0007h
PSMC2REBS_P2REBSIN_SIZE                  equ 0001h
PSMC2REBS_P2REBSIN_LENGTH                equ 0001h
PSMC2REBS_P2REBSIN_MASK                  equ 0080h

// Register: PSMC2FEBS
#define PSMC2FEBS PSMC2FEBS
PSMC2FEBS                                equ 0839h
// bitfield definitions
PSMC2FEBS_P2FEBSC1_POSN                  equ 0001h
PSMC2FEBS_P2FEBSC1_POSITION              equ 0001h
PSMC2FEBS_P2FEBSC1_SIZE                  equ 0001h
PSMC2FEBS_P2FEBSC1_LENGTH                equ 0001h
PSMC2FEBS_P2FEBSC1_MASK                  equ 0002h
PSMC2FEBS_P2FEBSC2_POSN                  equ 0002h
PSMC2FEBS_P2FEBSC2_POSITION              equ 0002h
PSMC2FEBS_P2FEBSC2_SIZE                  equ 0001h
PSMC2FEBS_P2FEBSC2_LENGTH                equ 0001h
PSMC2FEBS_P2FEBSC2_MASK                  equ 0004h
PSMC2FEBS_P2FEBSC3_POSN                  equ 0003h
PSMC2FEBS_P2FEBSC3_POSITION              equ 0003h
PSMC2FEBS_P2FEBSC3_SIZE                  equ 0001h
PSMC2FEBS_P2FEBSC3_LENGTH                equ 0001h
PSMC2FEBS_P2FEBSC3_MASK                  equ 0008h
PSMC2FEBS_P2FEBSIN_POSN                  equ 0007h
PSMC2FEBS_P2FEBSIN_POSITION              equ 0007h
PSMC2FEBS_P2FEBSIN_SIZE                  equ 0001h
PSMC2FEBS_P2FEBSIN_LENGTH                equ 0001h
PSMC2FEBS_P2FEBSIN_MASK                  equ 0080h

// Register: PSMC2PHS
#define PSMC2PHS PSMC2PHS
PSMC2PHS                                 equ 083Ah
// bitfield definitions
PSMC2PHS_P2PHST_POSN                     equ 0000h
PSMC2PHS_P2PHST_POSITION                 equ 0000h
PSMC2PHS_P2PHST_SIZE                     equ 0001h
PSMC2PHS_P2PHST_LENGTH                   equ 0001h
PSMC2PHS_P2PHST_MASK                     equ 0001h
PSMC2PHS_P2PHSC1_POSN                    equ 0001h
PSMC2PHS_P2PHSC1_POSITION                equ 0001h
PSMC2PHS_P2PHSC1_SIZE                    equ 0001h
PSMC2PHS_P2PHSC1_LENGTH                  equ 0001h
PSMC2PHS_P2PHSC1_MASK                    equ 0002h
PSMC2PHS_P2PHSC2_POSN                    equ 0002h
PSMC2PHS_P2PHSC2_POSITION                equ 0002h
PSMC2PHS_P2PHSC2_SIZE                    equ 0001h
PSMC2PHS_P2PHSC2_LENGTH                  equ 0001h
PSMC2PHS_P2PHSC2_MASK                    equ 0004h
PSMC2PHS_P2PHSC3_POSN                    equ 0003h
PSMC2PHS_P2PHSC3_POSITION                equ 0003h
PSMC2PHS_P2PHSC3_SIZE                    equ 0001h
PSMC2PHS_P2PHSC3_LENGTH                  equ 0001h
PSMC2PHS_P2PHSC3_MASK                    equ 0008h
PSMC2PHS_P2PHSIN_POSN                    equ 0007h
PSMC2PHS_P2PHSIN_POSITION                equ 0007h
PSMC2PHS_P2PHSIN_SIZE                    equ 0001h
PSMC2PHS_P2PHSIN_LENGTH                  equ 0001h
PSMC2PHS_P2PHSIN_MASK                    equ 0080h

// Register: PSMC2DCS
#define PSMC2DCS PSMC2DCS
PSMC2DCS                                 equ 083Bh
// bitfield definitions
PSMC2DCS_P2DCST_POSN                     equ 0000h
PSMC2DCS_P2DCST_POSITION                 equ 0000h
PSMC2DCS_P2DCST_SIZE                     equ 0001h
PSMC2DCS_P2DCST_LENGTH                   equ 0001h
PSMC2DCS_P2DCST_MASK                     equ 0001h
PSMC2DCS_P2DCSC1_POSN                    equ 0001h
PSMC2DCS_P2DCSC1_POSITION                equ 0001h
PSMC2DCS_P2DCSC1_SIZE                    equ 0001h
PSMC2DCS_P2DCSC1_LENGTH                  equ 0001h
PSMC2DCS_P2DCSC1_MASK                    equ 0002h
PSMC2DCS_P2DCSC2_POSN                    equ 0002h
PSMC2DCS_P2DCSC2_POSITION                equ 0002h
PSMC2DCS_P2DCSC2_SIZE                    equ 0001h
PSMC2DCS_P2DCSC2_LENGTH                  equ 0001h
PSMC2DCS_P2DCSC2_MASK                    equ 0004h
PSMC2DCS_P2DCSC3_POSN                    equ 0003h
PSMC2DCS_P2DCSC3_POSITION                equ 0003h
PSMC2DCS_P2DCSC3_SIZE                    equ 0001h
PSMC2DCS_P2DCSC3_LENGTH                  equ 0001h
PSMC2DCS_P2DCSC3_MASK                    equ 0008h
PSMC2DCS_P2DCSIN_POSN                    equ 0007h
PSMC2DCS_P2DCSIN_POSITION                equ 0007h
PSMC2DCS_P2DCSIN_SIZE                    equ 0001h
PSMC2DCS_P2DCSIN_LENGTH                  equ 0001h
PSMC2DCS_P2DCSIN_MASK                    equ 0080h

// Register: PSMC2PRS
#define PSMC2PRS PSMC2PRS
PSMC2PRS                                 equ 083Ch
// bitfield definitions
PSMC2PRS_P2PRST_POSN                     equ 0000h
PSMC2PRS_P2PRST_POSITION                 equ 0000h
PSMC2PRS_P2PRST_SIZE                     equ 0001h
PSMC2PRS_P2PRST_LENGTH                   equ 0001h
PSMC2PRS_P2PRST_MASK                     equ 0001h
PSMC2PRS_P2PRSC1_POSN                    equ 0001h
PSMC2PRS_P2PRSC1_POSITION                equ 0001h
PSMC2PRS_P2PRSC1_SIZE                    equ 0001h
PSMC2PRS_P2PRSC1_LENGTH                  equ 0001h
PSMC2PRS_P2PRSC1_MASK                    equ 0002h
PSMC2PRS_P2PRSC2_POSN                    equ 0002h
PSMC2PRS_P2PRSC2_POSITION                equ 0002h
PSMC2PRS_P2PRSC2_SIZE                    equ 0001h
PSMC2PRS_P2PRSC2_LENGTH                  equ 0001h
PSMC2PRS_P2PRSC2_MASK                    equ 0004h
PSMC2PRS_P2PRSC3_POSN                    equ 0003h
PSMC2PRS_P2PRSC3_POSITION                equ 0003h
PSMC2PRS_P2PRSC3_SIZE                    equ 0001h
PSMC2PRS_P2PRSC3_LENGTH                  equ 0001h
PSMC2PRS_P2PRSC3_MASK                    equ 0008h
PSMC2PRS_P2PRSIN_POSN                    equ 0007h
PSMC2PRS_P2PRSIN_POSITION                equ 0007h
PSMC2PRS_P2PRSIN_SIZE                    equ 0001h
PSMC2PRS_P2PRSIN_LENGTH                  equ 0001h
PSMC2PRS_P2PRSIN_MASK                    equ 0080h

// Register: PSMC2ASDC
#define PSMC2ASDC PSMC2ASDC
PSMC2ASDC                                equ 083Dh
// bitfield definitions
PSMC2ASDC_P2ASDOV_POSN                   equ 0000h
PSMC2ASDC_P2ASDOV_POSITION               equ 0000h
PSMC2ASDC_P2ASDOV_SIZE                   equ 0001h
PSMC2ASDC_P2ASDOV_LENGTH                 equ 0001h
PSMC2ASDC_P2ASDOV_MASK                   equ 0001h
PSMC2ASDC_P2ARSEN_POSN                   equ 0005h
PSMC2ASDC_P2ARSEN_POSITION               equ 0005h
PSMC2ASDC_P2ARSEN_SIZE                   equ 0001h
PSMC2ASDC_P2ARSEN_LENGTH                 equ 0001h
PSMC2ASDC_P2ARSEN_MASK                   equ 0020h
PSMC2ASDC_P2ASDEN_POSN                   equ 0006h
PSMC2ASDC_P2ASDEN_POSITION               equ 0006h
PSMC2ASDC_P2ASDEN_SIZE                   equ 0001h
PSMC2ASDC_P2ASDEN_LENGTH                 equ 0001h
PSMC2ASDC_P2ASDEN_MASK                   equ 0040h
PSMC2ASDC_P2ASE_POSN                     equ 0007h
PSMC2ASDC_P2ASE_POSITION                 equ 0007h
PSMC2ASDC_P2ASE_SIZE                     equ 0001h
PSMC2ASDC_P2ASE_LENGTH                   equ 0001h
PSMC2ASDC_P2ASE_MASK                     equ 0080h

// Register: PSMC2ASDL
#define PSMC2ASDL PSMC2ASDL
PSMC2ASDL                                equ 083Eh
// bitfield definitions
PSMC2ASDL_P2ASDLA_POSN                   equ 0000h
PSMC2ASDL_P2ASDLA_POSITION               equ 0000h
PSMC2ASDL_P2ASDLA_SIZE                   equ 0001h
PSMC2ASDL_P2ASDLA_LENGTH                 equ 0001h
PSMC2ASDL_P2ASDLA_MASK                   equ 0001h
PSMC2ASDL_P2ASDLB_POSN                   equ 0001h
PSMC2ASDL_P2ASDLB_POSITION               equ 0001h
PSMC2ASDL_P2ASDLB_SIZE                   equ 0001h
PSMC2ASDL_P2ASDLB_LENGTH                 equ 0001h
PSMC2ASDL_P2ASDLB_MASK                   equ 0002h

// Register: PSMC2ASDS
#define PSMC2ASDS PSMC2ASDS
PSMC2ASDS                                equ 083Fh
// bitfield definitions
PSMC2ASDS_P2ASDSC1_POSN                  equ 0001h
PSMC2ASDS_P2ASDSC1_POSITION              equ 0001h
PSMC2ASDS_P2ASDSC1_SIZE                  equ 0001h
PSMC2ASDS_P2ASDSC1_LENGTH                equ 0001h
PSMC2ASDS_P2ASDSC1_MASK                  equ 0002h
PSMC2ASDS_P2ASDSC2_POSN                  equ 0002h
PSMC2ASDS_P2ASDSC2_POSITION              equ 0002h
PSMC2ASDS_P2ASDSC2_SIZE                  equ 0001h
PSMC2ASDS_P2ASDSC2_LENGTH                equ 0001h
PSMC2ASDS_P2ASDSC2_MASK                  equ 0004h
PSMC2ASDS_P2ASDSC3_POSN                  equ 0003h
PSMC2ASDS_P2ASDSC3_POSITION              equ 0003h
PSMC2ASDS_P2ASDSC3_SIZE                  equ 0001h
PSMC2ASDS_P2ASDSC3_LENGTH                equ 0001h
PSMC2ASDS_P2ASDSC3_MASK                  equ 0008h
PSMC2ASDS_P2ASDSIN_POSN                  equ 0007h
PSMC2ASDS_P2ASDSIN_POSITION              equ 0007h
PSMC2ASDS_P2ASDSIN_SIZE                  equ 0001h
PSMC2ASDS_P2ASDSIN_LENGTH                equ 0001h
PSMC2ASDS_P2ASDSIN_MASK                  equ 0080h

