GopalSaraf/Practicals/PSDL/include/proc/pic16lf1783.inc
// Register: PSMC2BLKF
#define PSMC2BLKF PSMC2BLKF
PSMC2BLKF                                equ 084Ch
// bitfield definitions
PSMC2BLKF_PSMC2BLKF0_POSN                equ 0000h
PSMC2BLKF_PSMC2BLKF0_POSITION            equ 0000h
PSMC2BLKF_PSMC2BLKF0_SIZE                equ 0001h
PSMC2BLKF_PSMC2BLKF0_LENGTH              equ 0001h
PSMC2BLKF_PSMC2BLKF0_MASK                equ 0001h
PSMC2BLKF_PSMC2BLKF1_POSN                equ 0001h
PSMC2BLKF_PSMC2BLKF1_POSITION            equ 0001h
PSMC2BLKF_PSMC2BLKF1_SIZE                equ 0001h
PSMC2BLKF_PSMC2BLKF1_LENGTH              equ 0001h
PSMC2BLKF_PSMC2BLKF1_MASK                equ 0002h
PSMC2BLKF_PSMC2BLKF2_POSN                equ 0002h
PSMC2BLKF_PSMC2BLKF2_POSITION            equ 0002h
PSMC2BLKF_PSMC2BLKF2_SIZE                equ 0001h
PSMC2BLKF_PSMC2BLKF2_LENGTH              equ 0001h
PSMC2BLKF_PSMC2BLKF2_MASK                equ 0004h
PSMC2BLKF_PSMC2BLKF3_POSN                equ 0003h
PSMC2BLKF_PSMC2BLKF3_POSITION            equ 0003h
PSMC2BLKF_PSMC2BLKF3_SIZE                equ 0001h
PSMC2BLKF_PSMC2BLKF3_LENGTH              equ 0001h
PSMC2BLKF_PSMC2BLKF3_MASK                equ 0008h
PSMC2BLKF_PSMC2BLKF4_POSN                equ 0004h
PSMC2BLKF_PSMC2BLKF4_POSITION            equ 0004h
PSMC2BLKF_PSMC2BLKF4_SIZE                equ 0001h
PSMC2BLKF_PSMC2BLKF4_LENGTH              equ 0001h
PSMC2BLKF_PSMC2BLKF4_MASK                equ 0010h
PSMC2BLKF_PSMC2BLKF5_POSN                equ 0005h
PSMC2BLKF_PSMC2BLKF5_POSITION            equ 0005h
PSMC2BLKF_PSMC2BLKF5_SIZE                equ 0001h
PSMC2BLKF_PSMC2BLKF5_LENGTH              equ 0001h
PSMC2BLKF_PSMC2BLKF5_MASK                equ 0020h
PSMC2BLKF_PSMC2BLKF6_POSN                equ 0006h
PSMC2BLKF_PSMC2BLKF6_POSITION            equ 0006h
PSMC2BLKF_PSMC2BLKF6_SIZE                equ 0001h
PSMC2BLKF_PSMC2BLKF6_LENGTH              equ 0001h
PSMC2BLKF_PSMC2BLKF6_MASK                equ 0040h
PSMC2BLKF_PSMC2BLKF7_POSN                equ 0007h
PSMC2BLKF_PSMC2BLKF7_POSITION            equ 0007h
PSMC2BLKF_PSMC2BLKF7_SIZE                equ 0001h
PSMC2BLKF_PSMC2BLKF7_LENGTH              equ 0001h
PSMC2BLKF_PSMC2BLKF7_MASK                equ 0080h

// Register: PSMC2FFA
#define PSMC2FFA PSMC2FFA
PSMC2FFA                                 equ 084Dh
// bitfield definitions
PSMC2FFA_PSMC2FFA0_POSN                  equ 0000h
PSMC2FFA_PSMC2FFA0_POSITION              equ 0000h
PSMC2FFA_PSMC2FFA0_SIZE                  equ 0001h
PSMC2FFA_PSMC2FFA0_LENGTH                equ 0001h
PSMC2FFA_PSMC2FFA0_MASK                  equ 0001h
PSMC2FFA_PSMC2FFA1_POSN                  equ 0001h
PSMC2FFA_PSMC2FFA1_POSITION              equ 0001h
PSMC2FFA_PSMC2FFA1_SIZE                  equ 0001h
PSMC2FFA_PSMC2FFA1_LENGTH                equ 0001h
PSMC2FFA_PSMC2FFA1_MASK                  equ 0002h
PSMC2FFA_PSMC2FFA2_POSN                  equ 0002h
PSMC2FFA_PSMC2FFA2_POSITION              equ 0002h
PSMC2FFA_PSMC2FFA2_SIZE                  equ 0001h
PSMC2FFA_PSMC2FFA2_LENGTH                equ 0001h
PSMC2FFA_PSMC2FFA2_MASK                  equ 0004h
PSMC2FFA_PSMC2FFA3_POSN                  equ 0003h
PSMC2FFA_PSMC2FFA3_POSITION              equ 0003h
PSMC2FFA_PSMC2FFA3_SIZE                  equ 0001h
PSMC2FFA_PSMC2FFA3_LENGTH                equ 0001h
PSMC2FFA_PSMC2FFA3_MASK                  equ 0008h

// Register: PSMC2STR0
#define PSMC2STR0 PSMC2STR0
PSMC2STR0                                equ 084Eh
// bitfield definitions
PSMC2STR0_P2STRA_POSN                    equ 0000h
PSMC2STR0_P2STRA_POSITION                equ 0000h
PSMC2STR0_P2STRA_SIZE                    equ 0001h
PSMC2STR0_P2STRA_LENGTH                  equ 0001h
PSMC2STR0_P2STRA_MASK                    equ 0001h
PSMC2STR0_P2STRB_POSN                    equ 0001h
PSMC2STR0_P2STRB_POSITION                equ 0001h
PSMC2STR0_P2STRB_SIZE                    equ 0001h
PSMC2STR0_P2STRB_LENGTH                  equ 0001h
PSMC2STR0_P2STRB_MASK                    equ 0002h

// Register: PSMC2STR1
#define PSMC2STR1 PSMC2STR1
PSMC2STR1                                equ 084Fh
// bitfield definitions
PSMC2STR1_P2HSMEN_POSN                   equ 0000h
PSMC2STR1_P2HSMEN_POSITION               equ 0000h
PSMC2STR1_P2HSMEN_SIZE                   equ 0001h
PSMC2STR1_P2HSMEN_LENGTH                 equ 0001h
PSMC2STR1_P2HSMEN_MASK                   equ 0001h
PSMC2STR1_P2LSMEN_POSN                   equ 0001h
PSMC2STR1_P2LSMEN_POSITION               equ 0001h
PSMC2STR1_P2LSMEN_SIZE                   equ 0001h
PSMC2STR1_P2LSMEN_LENGTH                 equ 0001h
PSMC2STR1_P2LSMEN_MASK                   equ 0002h
PSMC2STR1_P2SSYNC_POSN                   equ 0007h
PSMC2STR1_P2SSYNC_POSITION               equ 0007h
PSMC2STR1_P2SSYNC_SIZE                   equ 0001h
PSMC2STR1_P2SSYNC_LENGTH                 equ 0001h
PSMC2STR1_P2SSYNC_MASK                   equ 0080h

// Register: STATUS_SHAD
#define STATUS_SHAD STATUS_SHAD
STATUS_SHAD                              equ 0FE4h
// bitfield definitions
STATUS_SHAD_C_SHAD_POSN                  equ 0000h
STATUS_SHAD_C_SHAD_POSITION              equ 0000h
STATUS_SHAD_C_SHAD_SIZE                  equ 0001h
STATUS_SHAD_C_SHAD_LENGTH                equ 0001h
STATUS_SHAD_C_SHAD_MASK                  equ 0001h
STATUS_SHAD_DC_SHAD_POSN                 equ 0001h
STATUS_SHAD_DC_SHAD_POSITION             equ 0001h
STATUS_SHAD_DC_SHAD_SIZE                 equ 0001h
STATUS_SHAD_DC_SHAD_LENGTH               equ 0001h
STATUS_SHAD_DC_SHAD_MASK                 equ 0002h
STATUS_SHAD_Z_SHAD_POSN                  equ 0002h
STATUS_SHAD_Z_SHAD_POSITION              equ 0002h
STATUS_SHAD_Z_SHAD_SIZE                  equ 0001h
STATUS_SHAD_Z_SHAD_LENGTH                equ 0001h
STATUS_SHAD_Z_SHAD_MASK                  equ 0004h

// Register: WREG_SHAD
#define WREG_SHAD WREG_SHAD
WREG_SHAD                                equ 0FE5h
// bitfield definitions
WREG_SHAD_WREG_SHAD_POSN                 equ 0000h
WREG_SHAD_WREG_SHAD_POSITION             equ 0000h
WREG_SHAD_WREG_SHAD_SIZE                 equ 0008h
WREG_SHAD_WREG_SHAD_LENGTH               equ 0008h
WREG_SHAD_WREG_SHAD_MASK                 equ 00FFh

// Register: BSR_SHAD
#define BSR_SHAD BSR_SHAD
BSR_SHAD                                 equ 0FE6h
// bitfield definitions
BSR_SHAD_BSR_SHAD_POSN                   equ 0000h
BSR_SHAD_BSR_SHAD_POSITION               equ 0000h
BSR_SHAD_BSR_SHAD_SIZE                   equ 0005h
BSR_SHAD_BSR_SHAD_LENGTH                 equ 0005h
BSR_SHAD_BSR_SHAD_MASK                   equ 001Fh

// Register: PCLATH_SHAD
#define PCLATH_SHAD PCLATH_SHAD
PCLATH_SHAD                              equ 0FE7h
// bitfield definitions
PCLATH_SHAD_PCLATH_SHAD_POSN             equ 0000h
PCLATH_SHAD_PCLATH_SHAD_POSITION         equ 0000h
PCLATH_SHAD_PCLATH_SHAD_SIZE             equ 0007h
PCLATH_SHAD_PCLATH_SHAD_LENGTH           equ 0007h
PCLATH_SHAD_PCLATH_SHAD_MASK             equ 007Fh

// Register: FSR0L_SHAD
#define FSR0L_SHAD FSR0L_SHAD
FSR0L_SHAD                               equ 0FE8h
// bitfield definitions
FSR0L_SHAD_FSR0L_SHAD_POSN               equ 0000h
FSR0L_SHAD_FSR0L_SHAD_POSITION           equ 0000h
FSR0L_SHAD_FSR0L_SHAD_SIZE               equ 0008h
FSR0L_SHAD_FSR0L_SHAD_LENGTH             equ 0008h
FSR0L_SHAD_FSR0L_SHAD_MASK               equ 00FFh

// Register: FSR0H_SHAD
#define FSR0H_SHAD FSR0H_SHAD
FSR0H_SHAD                               equ 0FE9h
// bitfield definitions
FSR0H_SHAD_FSR0H_SHAD_POSN               equ 0000h
FSR0H_SHAD_FSR0H_SHAD_POSITION           equ 0000h
FSR0H_SHAD_FSR0H_SHAD_SIZE               equ 0008h
FSR0H_SHAD_FSR0H_SHAD_LENGTH             equ 0008h
FSR0H_SHAD_FSR0H_SHAD_MASK               equ 00FFh

// Register: FSR1L_SHAD
#define FSR1L_SHAD FSR1L_SHAD
FSR1L_SHAD                               equ 0FEAh
// bitfield definitions
FSR1L_SHAD_FSR1L_SHAD_POSN               equ 0000h
FSR1L_SHAD_FSR1L_SHAD_POSITION           equ 0000h
FSR1L_SHAD_FSR1L_SHAD_SIZE               equ 0008h
FSR1L_SHAD_FSR1L_SHAD_LENGTH             equ 0008h
FSR1L_SHAD_FSR1L_SHAD_MASK               equ 00FFh

// Register: FSR1H_SHAD
#define FSR1H_SHAD FSR1H_SHAD
FSR1H_SHAD                               equ 0FEBh
// bitfield definitions
FSR1H_SHAD_FSR1H_SHAD_POSN               equ 0000h
FSR1H_SHAD_FSR1H_SHAD_POSITION           equ 0000h
FSR1H_SHAD_FSR1H_SHAD_SIZE               equ 0008h
FSR1H_SHAD_FSR1H_SHAD_LENGTH             equ 0008h
FSR1H_SHAD_FSR1H_SHAD_MASK               equ 00FFh

// Register: STKPTR
#define STKPTR STKPTR
STKPTR                                   equ 0FEDh
// bitfield definitions
STKPTR_STKPTR_POSN                       equ 0000h
STKPTR_STKPTR_POSITION                   equ 0000h
STKPTR_STKPTR_SIZE                       equ 0005h
STKPTR_STKPTR_LENGTH                     equ 0005h
STKPTR_STKPTR_MASK                       equ 001Fh

